In [41]:
import pandas as pd
import numpy as np

In [42]:
mydict = {'name':['Ade','Wale','Tade','Musa','Azeez','yomi','bello','yemi','ahmad','yusuf'],
        'relationship':['Single','Single','married','single','single','single','married','married','married','married'],
        'age':[25,30,34,23,43,24,25,34,42,21],
        'department':['mrh','bch','ecn','cli','den','lang','nsc','geo','eee','mech']}

In [43]:
mydict['cgpa'] = [2.0,3.4,5.0,5.0,3.8,5.0,5.0,4.9,3.4,4.9]

In [44]:
mydict.pop('relationship')

['Single',
 'Single',
 'married',
 'single',
 'single',
 'single',
 'married',
 'married',
 'married',
 'married']

In [45]:
df=pd.DataFrame(mydict)
df

    name  age department  cgpa
0    Ade   25        mrh   2.0
1   Wale   30        bch   3.4
2   Tade   34        ecn   5.0
3   Musa   23        cli   5.0
4  Azeez   43        den   3.8
5   yomi   24       lang   5.0
6  bello   25        nsc   5.0
7   yemi   34        geo   4.9
8  ahmad   42        eee   3.4
9  yusuf   21       mech   4.9

In [46]:
df['admission_date']=['2022-04-07','2022-04-07','2022-04-07', '2022-04-07','2022-04-07','2022-04-07','2022-04-07','2022-04-07','2022-04-07','2022-04-07']
df['gender']=['M','M','M','M','M','M','M','M','M','M']

In [47]:
df

    name  age department  cgpa admission_date gender
0    Ade   25        mrh   2.0     2022-04-07      M
1   Wale   30        bch   3.4     2022-04-07      M
2   Tade   34        ecn   5.0     2022-04-07      M
3   Musa   23        cli   5.0     2022-04-07      M
4  Azeez   43        den   3.8     2022-04-07      M
5   yomi   24       lang   5.0     2022-04-07      M
6  bello   25        nsc   5.0     2022-04-07      M
7   yemi   34        geo   4.9     2022-04-07      M
8  ahmad   42        eee   3.4     2022-04-07      M
9  yusuf   21       mech   4.9     2022-04-07      M

In [48]:
name =['Adewap','Walexy','shade','Isa','Azeezah','Temi','bello','yemi','bose','Biola']
age =[20, 32, 24, 20, 23, 20, 20, 30, 22, 23]
department =['mrh', 'bch', 'ecn', 'cli', 'den', 'lang', 'nsc', 'geo', 'eee', 'mech']
cgpa = [3.0,2.4,4.0,4.0,3.5,5.0,5.0,3.9,3.4,2.9]
admission_date =['2022-04-07','2022-04-07','2022-04-07', '2022-04-07','2022-04-07','2022-04-07','2022-04-07','2022-04-07','2022-04-07','2022-04-07']
gender=['M','M','F','M','F','M','F','M','F','F']
df2=pd.DataFrame({'Name':name,'Age':age, 'Department':department,'Cgpa':cgpa,'Admission_date':admission_date,'Gender':gender})

In [49]:
df2

      Name  Age Department  Cgpa Admission_date Gender
0   Adewap   20        mrh   3.0     2022-04-07      M
1   Walexy   32        bch   2.4     2022-04-07      M
2    shade   24        ecn   4.0     2022-04-07      F
3      Isa   20        cli   4.0     2022-04-07      M
4  Azeezah   23        den   3.5     2022-04-07      F
5     Temi   20       lang   5.0     2022-04-07      M
6    bello   20        nsc   5.0     2022-04-07      F
7     yemi   30        geo   3.9     2022-04-07      M
8     bose   22        eee   3.4     2022-04-07      F
9    Biola   23       mech   2.9     2022-04-07      F

In [50]:
df['admission_date'] = pd.to_datetime(df['admission_date'])
df.dtypes

name                      object
age                        int64
department                object
cgpa                     float64
admission_date    datetime64[ns]
gender                    object
dtype: object

In [52]:
df['year']= df['admission_date'].dt.year
df

    name  age department  cgpa admission_date gender  year
0    Ade   25        mrh   2.0     2022-04-07      M  2022
1   Wale   30        bch   3.4     2022-04-07      M  2022
2   Tade   34        ecn   5.0     2022-04-07      M  2022
3   Musa   23        cli   5.0     2022-04-07      M  2022
4  Azeez   43        den   3.8     2022-04-07      M  2022
5   yomi   24       lang   5.0     2022-04-07      M  2022
6  bello   25        nsc   5.0     2022-04-07      M  2022
7   yemi   34        geo   4.9     2022-04-07      M  2022
8  ahmad   42        eee   3.4     2022-04-07      M  2022
9  yusuf   21       mech   4.9     2022-04-07      M  2022

In [53]:
df['month']= df['admission_date'].dt.month
df

    name  age department  cgpa admission_date gender  year  month
0    Ade   25        mrh   2.0     2022-04-07      M  2022      4
1   Wale   30        bch   3.4     2022-04-07      M  2022      4
2   Tade   34        ecn   5.0     2022-04-07      M  2022      4
3   Musa   23        cli   5.0     2022-04-07      M  2022      4
4  Azeez   43        den   3.8     2022-04-07      M  2022      4
5   yomi   24       lang   5.0     2022-04-07      M  2022      4
6  bello   25        nsc   5.0     2022-04-07      M  2022      4
7   yemi   34        geo   4.9     2022-04-07      M  2022      4
8  ahmad   42        eee   3.4     2022-04-07      M  2022      4
9  yusuf   21       mech   4.9     2022-04-07      M  2022      4

In [54]:
df['day']= df['admission_date'].dt.day
df

    name  age department  cgpa admission_date gender  year  month  day
0    Ade   25        mrh   2.0     2022-04-07      M  2022      4    7
1   Wale   30        bch   3.4     2022-04-07      M  2022      4    7
2   Tade   34        ecn   5.0     2022-04-07      M  2022      4    7
3   Musa   23        cli   5.0     2022-04-07      M  2022      4    7
4  Azeez   43        den   3.8     2022-04-07      M  2022      4    7
5   yomi   24       lang   5.0     2022-04-07      M  2022      4    7
6  bello   25        nsc   5.0     2022-04-07      M  2022      4    7
7   yemi   34        geo   4.9     2022-04-07      M  2022      4    7
8  ahmad   42        eee   3.4     2022-04-07      M  2022      4    7
9  yusuf   21       mech   4.9     2022-04-07      M  2022      4    7

In [55]:
#datatype of all columns

df.dtypes

name                      object
age                        int64
department                object
cgpa                     float64
admission_date    datetime64[ns]
gender                    object
year                       int64
month                      int64
day                        int64
dtype: object

In [56]:
#missing value
df.isna().sum()

name              0
age               0
department        0
cgpa              0
admission_date    0
gender            0
year              0
month             0
day               0
dtype: int64

In [57]:
#missing value
df.isnull().any()

name              False
age               False
department        False
cgpa              False
admission_date    False
gender            False
year              False
month             False
day               False
dtype: bool

In [58]:
#%of missing value
df.isnull().sum()/df.shape[0]*100

name              0.0
age               0.0
department        0.0
cgpa              0.0
admission_date    0.0
gender            0.0
year              0.0
month             0.0
day               0.0
dtype: float64

In [59]:
#unique values

df.name.unique()

array(['Ade', 'Wale', 'Tade', 'Musa', 'Azeez', 'yomi', 'bello', 'yemi',
       'ahmad', 'yusuf'], dtype=object)

In [60]:
df.age.unique()

array([25, 30, 34, 23, 43, 24, 42, 21], dtype=int64)

In [61]:
df.department.unique()

array(['mrh', 'bch', 'ecn', 'cli', 'den', 'lang', 'nsc', 'geo', 'eee',
       'mech'], dtype=object)

In [63]:
df.cgpa.unique()

array([2. , 3.4, 5. , 3.8, 4.9])

In [65]:
df.admission_date.unique()

array(['2022-04-07T00:00:00.000000000'], dtype='datetime64[ns]')

In [66]:
df.gender.unique()

array(['M'], dtype=object)

In [67]:
#no of unique values
df.name.nunique()

10

In [68]:
df.age.nunique()

8

In [69]:
df.department.nunique()

10

In [70]:
df.cgpa.nunique()

5

In [71]:
df.admission_date.nunique()

1

In [72]:
df.gender.nunique()

1

In [77]:
#valuecounts


df['name'].value_counts()

Ade      1
Wale     1
Tade     1
Musa     1
Azeez    1
yomi     1
bello    1
yemi     1
ahmad    1
yusuf    1
Name: name, dtype: int64

In [78]:
df['age'].value_counts()

25    2
34    2
30    1
23    1
43    1
24    1
42    1
21    1
Name: age, dtype: int64

In [79]:
df['department'].value_counts()

mrh     1
bch     1
ecn     1
cli     1
den     1
lang    1
nsc     1
geo     1
eee     1
mech    1
Name: department, dtype: int64

In [80]:
df['cgpa'].value_counts()

5.0    4
3.4    2
4.9    2
2.0    1
3.8    1
Name: cgpa, dtype: int64

In [81]:
df['admission_date'].value_counts()

2022-04-07    10
Name: admission_date, dtype: int64

In [82]:
df['gender'].value_counts()

M    10
Name: gender, dtype: int64

In [84]:
#df.info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            10 non-null     object
 1   age             10 non-null     int64
 2   department      10 non-null     object
 3   cgpa            10 non-null     float64
 4   admission_date  10 non-null     datetime64[ns]
 5   gender          10 non-null     object
 6   year            10 non-null     int64
 7   month           10 non-null     int64
 8   day             10 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(4), object(3)
memory usage: 848.0+ bytes

In [85]:
df.describe()

             age       cgpa    year  month   day
count  10.000000  10.000000    10.0   10.0  10.0
mean   30.100000   4.240000  2022.0    4.0   7.0
std     7.894442   1.043711     0.0    0.0   0.0
min    21.000000   2.000000  2022.0    4.0   7.0
25%    24.250000   3.500000  2022.0    4.0   7.0
50%    27.500000   4.900000  2022.0    4.0   7.0
75%    34.000000   5.000000  2022.0    4.0   7.0
max    43.000000   5.000000  2022.0    4.0   7.0

In [ ]:
#no of rows and columns

In [86]:
#row

df.shape[0]

10

In [87]:
#column

df.shape[1]

9

In [89]:
df.query("gender=='M'")

    name  age department  cgpa admission_date gender  year  month  day
0    Ade   25        mrh   2.0     2022-04-07      M  2022      4    7
1   Wale   30        bch   3.4     2022-04-07      M  2022      4    7
2   Tade   34        ecn   5.0     2022-04-07      M  2022      4    7
3   Musa   23        cli   5.0     2022-04-07      M  2022      4    7
4  Azeez   43        den   3.8     2022-04-07      M  2022      4    7
5   yomi   24       lang   5.0     2022-04-07      M  2022      4    7
6  bello   25        nsc   5.0     2022-04-07      M  2022      4    7
7   yemi   34        geo   4.9     2022-04-07      M  2022      4    7
8  ahmad   42        eee   3.4     2022-04-07      M  2022      4    7
9  yusuf   21       mech   4.9     2022-04-07      M  2022      4    7

In [90]:
#mean,max,sum,min of cgpa

In [91]:
df['cgpa'].mean()

4.24

In [92]:
df['cgpa'].max()

5.0

In [93]:
df['cgpa'].min()

2.0

In [94]:
df['cgpa'].sum()

42.4

In [95]:
df

    name  age department  cgpa admission_date gender  year  month  day
0    Ade   25        mrh   2.0     2022-04-07      M  2022      4    7
1   Wale   30        bch   3.4     2022-04-07      M  2022      4    7
2   Tade   34        ecn   5.0     2022-04-07      M  2022      4    7
3   Musa   23        cli   5.0     2022-04-07      M  2022      4    7
4  Azeez   43        den   3.8     2022-04-07      M  2022      4    7
5   yomi   24       lang   5.0     2022-04-07      M  2022      4    7
6  bello   25        nsc   5.0     2022-04-07      M  2022      4    7
7   yemi   34        geo   4.9     2022-04-07      M  2022      4    7
8  ahmad   42        eee   3.4     2022-04-07      M  2022      4    7
9  yusuf   21       mech   4.9     2022-04-07      M  2022      4    7

In [100]:
df.to_csv('project 1 053')